Repository: ebena107/redesigned-feed-app
Catalog: lib/l10n/app_*.arb
Languages: fr, pt, sw, tl

# appTitle
source: Feed Estimator
fr: Estimateur d'Aliment
pt: Estimador de Ração

# appDescription
source: Livestock feed formulation optimizer
fr: Optimiseur de formulation d'aliment pour bétail
pt: Otimizador de formulação de ração para rebanho
sw: Lugha ya uongezaji wa chakula cha mifugo
tl: Optimizer ng pagbuo ng pagkain ng hayop

# navHome
source: Home
fr: Accueil
pt: Início
sw: Nyumbani
tl: Tahanan

# navFeeds
source: My Feeds
fr: Mes Aliments
pt: Minhas Rações
sw: Chakula Changu
tl: Aking mga Pagkain

# navIngredients
source: Ingredients
fr: Ingrédients
pt: Ingredientes
sw: Vipengele
tl: Sangkap

# navSettings
source: Settings
fr: Paramètres
pt: Configurações
sw: Mipango
tl: Mga Ayos

# navAbout
source: About
fr: À Propos
pt: Sobre
sw: Kuhusu
tl: Tungkol sa amin

# screenTitleHome
source: Feed Formulation
fr: Formulation d'Aliment
pt: Formulação de Ração
sw: Uandaaji wa Chakula
tl: Pagbuo ng Pagkain

# screenTitleIngredientLibrary
source: Ingredient Library
fr: Bibliothèque d'Ingrédients
pt: Biblioteca de Ingredientes
sw: Maktaba ya Vipengele
tl: Aklat ng Sangkap

# screenTitleNewFeed
source: Create Feed
fr: Créer Aliment
pt: Criar Ração
sw: Tengeneza Chakula
tl: Lumikha ng Pagkain

# screenTitleReports
source: Analysis
fr: Analyse
pt: Análise
sw: Uchambuzi
tl: Analisis

# screenTitleSettings
source: Settings
fr: Paramètres
pt: Configurações
sw: Mipango
tl: Mga Ayos

# screenTitleAbout
source: About Feed Estimator
fr: À Propos d'Estimateur d'Aliment
pt: Sobre Estimador de Ração
sw: Kuhusu Feed Estimator
tl: Tungkol sa Feed Estimator

# screenTitleImportWizard
source: Import Wizard
fr: Assistant d'importation
pt: Assistente de Importação

# actionCreate
source: Create
fr: Créer
pt: Criar
sw: Tengeneza
tl: Lumikha

# actionSave
source: Save
fr: Enregistrer
pt: Salvar
sw: Hifadhi
tl: I-save

# actionUpdate
source: Update
fr: Mettre à Jour
pt: Atualizar
sw: Sasisha
tl: I-update

# actionDelete
source: Delete
fr: Supprimer
pt: Excluir
sw: Futa
tl: Tanggalin

# actionCancel
source: Cancel
fr: Annuler
pt: Cancelar
sw: Ghairi
tl: Kanselahin

# actionAdd
source: Add
fr: Ajouter
pt: Adicionar
sw: Ongeza
tl: Magdagdag

# actionAddNew
source: Add New
fr: Ajouter Nouveau
pt: Adicionar Novo
sw: Ongeza Mpya
tl: Magdagdag ng Bago

# actionRefresh
source: Refresh
fr: Rafraîchir
pt: Atualizar
sw: Onesha Upya
tl: I-refresh

# actionEdit
source: Edit
fr: Modifier
pt: Editar
sw: Hariri
tl: Baguhin

# actionRemove
source: Remove
fr: Retirer
pt: Remover
sw: Ondoa
tl: Alisin

# actionClose
source: Close
fr: Fermer
pt: Fechar
sw: Funga
tl: Isara

# actionRetry
source: Retry
fr: Réessayer
pt: Tentar Novamente
sw: Jaribu Tena
tl: Subukang Muli

# actionViewReport
source: View Report
fr: Voir le Rapport
pt: Ver Relatório
sw: Tazama Ripoti
tl: Tingnan ang Ulat

# actionClear
source: Clear
fr: Effacer
pt: Limpar
sw: Futa
tl: Linisin

# actionClearFilters
source: Clear Filters
fr: Effacer les Filtres
pt: Limpar Filtros
sw: Futa Vichujio
tl: Linisin ang mga Salaan

# actionSaveChanges
source: Save Changes
fr: Enregistrer les Modifications
pt: Salvar Alterações
sw: Hifadhi Mabadiliko
tl: Salbahin ang Pagbabago

# actionReset
source: Reset
fr: Réinitialiser
pt: Redefinir
sw: Rejezesha
tl: I-reset

# homeEmptyTitle
source: No Feeds Yet
fr: Aucun Aliment Pour l'Instant
pt: Sem Rações Ainda
sw: Hakuna Chakula Bado
tl: Walang Feed Pa

# homeEmptySubtitle
source: Create your first feed formulation
fr: Créez votre première formulation d'aliment
pt: Crie sua primeira formulação de ração
sw: Unda muundo wako wa kwanza wa chakula
tl: Gumawa ng iyong unang pormulasyon ng feed

# homeCreateFeed
source: Create Feed
fr: Créer un Aliment
pt: Criar Ração
sw: Unda Chakula
tl: Gumawa ng Feed

# homeAddFeed
source: Add Feed
fr: Ajouter un Aliment
pt: Adicionar Ração
sw: Ongeza Chakula
tl: Magdagdag ng Feed

# homeLoadFailed
source: Failed to load feeds: {error}
fr: Échec du chargement des aliments: {error}
pt: Falha ao carregar rações: {error}
sw: Imeshindwa kupakia chakula: {error}
tl: Hindi makarga ang mga feed: {error}

# homeLoadingFeeds
source: Loading feeds...
fr: Chargement des aliments...
pt: Carregando rações...
sw: Inapakia chakula...
tl: Kinakarga ang mga feed...

# feedListEmpty
source: No Feed Available
fr: Aucun Aliment Disponible
pt: Sem Rações Disponíveis
sw: Hakuna Chakula Kilichopatikana
tl: Walang Available na Feed

# feedsLoadFailed
source: Failed to load feeds
fr: Échec du chargement des aliments
pt: Falha ao carregar rações
sw: Imeshindwa kupakia chakula
tl: Hindi makarga ang mga feed

# feedsEmptyStateTitle
source: No feeds found
fr: Aucun aliment trouvé
pt: Nenhuma ração encontrada
sw: Hakuna chakula kilipatikana
tl: Walang nakitang feed

# feedNameUnknown
source: Unknown Feed
fr: Aliment Inconnu
pt: Ração Desconhecida
sw: Chakula Kisichojulikana
tl: Hindi Kilalang Feed

# feedSubtitle
source: {animalType} Feed
fr: Aliment pour {animalType}
pt: Ração para {animalType}
sw: Chakula cha {animalType}
tl: Feed para sa {animalType}

# feedDeleteTitle
source: Delete "{feedName}"?
fr: Supprimer "{feedName}"?
pt: Excluir "{feedName}"?
sw: Futa "{feedName}"?
tl: Tanggalin ang "{feedName}"?

# confirmDeletionWarning
source: This action cannot be undone.
fr: Cette action ne peut pas être annulée.
pt: Esta ação não pode ser desfeita.
sw: Hatua hii haiwezi kutenguka.
tl: Hindi na mababawi ang aksyong ito.

# feedStoreTitle
source: Feed in Store
fr: Aliments en Stock
pt: Rações em Estoque
sw: Chakula katika Ghala
tl: Feed sa Bodega

# feedStorePlaceholder
source: Stored Feed here
fr: Aliments stockés ici
pt: Rações armazenadas aqui
sw: Chakula kilichohifadhiwa hapa
tl: Nakaimbak na feed dito

# ingredientSelectedLabel
source: Selected Ingredient
fr: Ingrédient Sélectionné
pt: Ingrediente Selecionado
sw: Kiambata Kilichochaguliwa
tl: Napiling Sangkap

# ingredientSelectLabel
source: Select Ingredient
fr: Sélectionner un Ingrédient
pt: Selecionar Ingrediente
sw: Chagua Kiambata
tl: Pumili ng Sangkap

# ingredientSelectTitle
source: Select Ingredient
fr: Sélectionner un Ingrédient
pt: Selecionar Ingrediente
sw: Chagua Kiambata
tl: Pumili ng Sangkap

# ingredientSearchHint
source: Search by name...
fr: Rechercher par nom...
pt: Buscar por nome...
sw: Tafuta kwa jina...
tl: Maghanap gamit ang pangalan...

# ingredientNameUnknown
source: Unknown
fr: Inconnu
pt: Desconhecido
sw: Haijulikani
tl: Hindi Kilala

# ingredientAvailableQty
source: {qty} kg available
fr: {qty} kg disponibles
pt: {qty} kg disponíveis
sw: {qty} kg zinapatikana

# ingredientsLoadFailed
source: Failed to load ingredients
fr: Échec du chargement des ingrédients
pt: Falha ao carregar ingredientes
sw: Imeshindwa kupakia viambata
tl: Hindi makarga ang mga sangkap

# ingredientsEmptyTitle
source: No ingredients found
fr: Aucun ingrédient trouvé
pt: Nenhum ingrediente encontrado
sw: Hakuna viambata vilivyopatikana
tl: Walang nakitang sangkap

# ingredientsEmptySubtitle
source: Add ingredients to get started
fr: Ajoutez des ingrédients pour commencer
pt: Adicione ingredientes para começar
sw: Ongeza viambata ili kuanza
tl: Magdagdag ng mga sangkap para magsimula

# ingredientsEmptyFilteredTitle
source: No ingredients match your filters
fr: Aucun ingrédient ne correspond à vos filtres
pt: Nenhum ingrediente corresponde aos seus filtros
sw: Hakuna viambata vinavyolingana na vichujio vyako
tl: Walang sangkap na tumutugma sa iyong mga salaan

# ingredientsEmptyFilteredSubtitle
source: Try adjusting your search or filters
fr: Essayez d'ajuster votre recherche ou vos filtres
pt: Tente ajustar sua busca ou filtros
sw: Jaribu kurekebisha utafutaji au vichujio vyako
tl: Subukang baguhin ang iyong paghahanap o mga salaan

# filterFavorites
source: Favorites
fr: Favoris
pt: Favoritos
sw: Vipendwa
tl: Mga Paborito

# filterCustom
source: Custom
fr: Personnalisés
pt: Personalizados
sw: Maalum

# filterRegionLabel
source: Region: {region}
fr: Région: {region}
pt: Região: {region}
sw: Mkoa: {region}
tl: Rehiyon: {region}

# actionExport
source: Export
fr: Exporter
pt: Exportar
sw: Hamisha
tl: I-export

# actionImport
source: Import
fr: Importer
pt: Importar
sw: Ingiza
tl: I-import

# labelName
source: Name
fr: Nom
pt: Nome
sw: Jina
tl: Pangalan

# labelPrice
source: Price
fr: Prix
pt: Preço
sw: Bei
tl: Presyo

# labelQuantity
source: Quantity
fr: Quantité
pt: Quantidade
sw: Kiasi
tl: Dami

# labelCategory
source: Category
fr: Catégorie
pt: Categoria
sw: Aina
tl: Kategorya

# labelRegion
source: Region
fr: Région
pt: Região
sw: Eneo
tl: Rehiyon

# labelProtein
source: Protein
fr: Protéine
pt: Proteína
sw: Protini
tl: Protina

# labelFat
source: Fat
fr: Graisse
pt: Gordura
sw: Mafuta
tl: Taba

# labelFiber
source: Fiber
fr: Fibre
pt: Fibra
sw: Nyuzi
tl: Bituin

# labelCalcium
source: Calcium
pt: Cálcio
sw: Kalisiamu
tl: Kalyo

# labelPhosphorus
source: Phosphorus
fr: Phosphore
pt: Fósforo
sw: Fosfoni
tl: Fosforo

# labelEnergy
source: Energy
fr: Énergie
pt: Energia
sw: Nishati
tl: Lakas

# labelCost
source: Cost
fr: Coût
pt: Custo
sw: Gharama
tl: Halaga

# hintEnterName
source: e.g., Broiler Starter
fr: ex: Aliment Démarrage pour Poulet
pt: ex: Ração de Inicial para Frango
sw: k.m., Chakula cha Kuku
tl: halimbawa, Pagkain ng Broiler Starter

# hintSearch
source: Search ingredients...
fr: Rechercher des ingrédients...
pt: Pesquisar ingredientes...
sw: Tafuta vipengele...
tl: Maghanap ng sangkap...

# hintSelectIngredient
source: Tap to select ingredient
fr: Appuyez pour sélectionner un ingrédient
pt: Toque para selecionar ingrediente
sw: Gusa kuchagua kipengele
tl: Tapikin upang pumili ng sangkap

# errorRequired
source: {field} is required
fr: {field} est obligatoire
pt: {field} é obrigatório
sw: {field} inahitajika
tl: Kailangan ang {field}

# errorInvalidPrice
source: Enter valid price (e.g., 10.50)
fr: Entrez un prix valide (ex: 10.50)
pt: Insira preço válido (ex: 10.50)
sw: Ingiza bei sahihi (k.m., 10.50)
tl: Magpasok ng tamang presyo (halimbawa, 10.50)

# errorInvalidQuantity
source: Enter valid quantity (e.g., 100)
fr: Entrez une quantité valide (ex: 100)
pt: Insira quantidade válida (ex: 100)
sw: Ingiza kiasi sahihi (k.m., 100)
tl: Magpasok ng tamang dami (halimbawa, 100)

# errorPriceNegative
source: Price cannot be negative
fr: Le prix ne peut pas être négatif
pt: O preço não pode ser negativo
sw: Bei haiwezi kuwa hasi
tl: Ang presyo ay hindi maaaring negatibo

# errorQuantityZero
source: Quantity must be greater than 0
fr: La quantité doit être supérieure à 0
pt: A quantidade deve ser maior que 0
sw: Kiasi lazima kiwe zaidi ya 0
tl: Ang dami ay dapat na higit sa 0

# errorNameTooShort
source: Name must be at least 3 characters
fr: Le nom doit avoir au moins 3 caractères
pt: O nome deve ter pelo menos 3 caracteres
sw: Jina lazima liwe na angalau herufi 3
tl: Ang pangalan ay dapat na hindi bababa sa 3 na karakter

# errorNameTooLong
source: Name must be less than 50 characters
fr: Le nom doit avoir moins de 50 caractères
pt: O nome deve ter menos de 50 caracteres
sw: Jina lazima liwe chini ya herufi 50
tl: Ang pangalan ay dapat na mas mababa sa 50 na karakter

# errorUnique
source: {field} already exists
fr: {field} existe déjà
pt: {field} já existe
sw: {field} tayari ipo
tl: Ang {field} ay umiiral na

# errorDatabaseOperation
source: Database operation failed. Please try again.
fr: L'opération de base de données a échoué. Réessayez.
pt: Operação de banco de dados falhou. Tente novamente.
sw: Operesheni ya hifadhidata imeshindwa. Jaribu tena.
tl: Nabigo ang database na operasyon. Subukan muli.

# errorNetworkError
source: Network error. Please check your connection.
fr: Erreur réseau. Vérifiez votre connexion.
pt: Erro de rede. Verifique sua conexão.
sw: Hitilafu ya mtandao. Tafadhali angalia muunganisho wako.
tl: Kamalian sa network. Mangyaring suriin ang iyong koneksyon.

# messageCreatedSuccessfully
source: {item} created successfully
fr: {item} créé avec succès
pt: {item} criado com sucesso
sw: {item} ilikuwa imetengenezwa kwa mafanikio
tl: Matagumpay na nilikha ang {item}

# messageUpdatedSuccessfully
source: {item} updated successfully
fr: {item} mis à jour avec succès
pt: {item} atualizado com sucesso
sw: {item} imesasishwa kwa mafanikio
tl: Matagumpay na na-update ang {item}

# messageDeletedSuccessfully
source: {item} deleted successfully
fr: {item} supprimé avec succès
pt: {item} deletado com sucesso
sw: {item} imefutwa kwa mafanikio
tl: Matagumpay na natanggal ang {item}

# messageLoading
source: Loading...
fr: Chargement...
pt: Carregando...
sw: Inapakia...
tl: Naglo-load...

# messageNoData
source: No data available
fr: Aucune donnée disponible
pt: Nenhum dado disponível
sw: Hakuna data inayopatikana
tl: Walang available na datos

# messageEmpty
source: No {item} added yet
fr: Aucun {item} ajouté encore
pt: Nenhum {item} adicionado ainda
sw: Hakuna {item} imeongezwa bado
tl: Walang {item} na naidagdag pa

# confirmDelete
source: Delete {item}?
fr: Supprimer {item}?
pt: Deletar {item}?
sw: Futa
tl: Tanggalin

# confirmDeleteDescription
source: This action cannot be undone.
fr: Cette action ne peut pas être annulée.
pt: Esta ação não pode ser desfeita.
sw: Hatua hii haiwezi kufanywa upya.
tl: Ang aksyon na ito ay hindi maaaring ibalik.

# animalTypePig
source: Pig
fr: Porc
pt: Porco
sw: Nguruwe
tl: Baboy

# animalTypePoultry
source: Poultry
fr: Volaille
pt: Frango
sw: Kuku
tl: Manok

# animalTypeRabbit
source: Rabbit
fr: Lapin
pt: Coelho
sw: Sungura
tl: Kuneho

# animalTypeRuminant
source: Ruminant
pt: Ruminante
sw: Mifugaji
tl: Umiing Hayop

# animalTypeFish
source: Fish
fr: Poisson
pt: Peixe
sw: Samaki
tl: Isda

# regionAll
source: All Regions
fr: Toutes les Régions
pt: Todas as Regiões
sw: Zote
tl: Lahat

# regionAfrica
source: Africa
fr: Afrique
pt: África
sw: Afrika

# regionAsia
source: Asia
fr: Asie
pt: Ásia
sw: Azia
tl: Asya

# regionEurope
source: Europe
pt: Europa
sw: Uropa
tl: Europa

# regionAmericas
source: Americas
fr: Amériques
pt: Américas
sw: Amerika
tl: Amerika

source: Filter By
fr: Filtrer Par
pt: Filtrar Por
sw: Chuja Kwa
tl: I-filter ayon sa

source: Sort By
fr: Trier Par
pt: Ordenar Por
sw: Panga Kwa
tl: Pagsort ayon sa

# sortByName
source: Name
fr: Nom
pt: Nome
sw: Jina
tl: Pangalan

# sortByPrice
source: Price
fr: Prix
pt: Preço
sw: Bei
tl: Presyo

# sortByRegion
source: Region
fr: Région
pt: Região
sw: Eneo
tl: Rehiyon

# settingLanguage
source: Language
fr: Langue
pt: Idioma
sw: Lugha
tl: Wika

# settingTheme
source: Theme
fr: Thème
pt: Tema
sw: Mandhari
tl: Tema

# settingNotifications
source: Notifications
pt: Notificações
sw: Arifa
tl: Mga Notipikasyon

# settingAbout
source: About
fr: À Propos
pt: Sobre
sw: Kuhusu
tl: Tungkol sa amin

# aboutVersion
source: Version {version}
pt: Versão {version}
sw: Toleo {version}
tl: Bersyon {version}

# aboutPrivacy
source: Privacy Policy
fr: Politique de Confidentialité
pt: Política de Privacidade
sw: Sera ya Faragha
tl: Patakaran sa Privacy

# aboutTerms
source: Terms of Service
fr: Conditions d'Utilisation
pt: Termos de Serviço
sw: Masharti ya Huduma
tl: Mga Tuntunin ng Serbisyo

# aboutDeveloper
source: Developed for livestock farmers
fr: Développé pour les éleveurs de bétail
pt: Desenvolvido para criadores de gado
sw: Iliyoendekezwa kwa wakulima wa mifugo
tl: Ginawa para sa mga magsasaka ng hayop

# aboutContribution
source: Your feedback helps us improve
fr: Vos commentaires nous aident à nous améliorer
pt: Seus comentários nos ajudam a melhorar
sw: Maoni yako husaidia sisi kuboresha
tl: Ang iyong feedback ay tumutulong sa amin na mapabuti

# settingsTitle
source: Settings
fr: Paramètres
pt: Configurações
sw: Mipango
tl: Mga Setting

# settingsSectionLanguage
source: Language
fr: Langue
pt: Idioma
sw: Lugha
tl: Wika

# settingsSectionPrivacy
source: Privacy & Data
fr: Confidentialité et Données
pt: Privacidade e Dados
sw: Faragha na Data
tl: Privacy at Data

# settingsSectionDataManagement
source: Data Management
fr: Gestion des Données
pt: Gestão de Dados
sw: Usimamizi wa Data
tl: Pamamahala ng Data

# settingsSelectLanguage
source: Select Language
fr: Sélectionner la Langue
pt: Selecionar Idioma
sw: Chagua Lugha
tl: Pumili ng Wika

# settingsLanguageLimitedUI
source: {language} (Limited system UI)
fr: {language} (Interface système limitée)
pt: {language} (Interface do sistema limitada)
sw: {language} (Kiolesura cha mfumo kilichowezeshwa)
tl: {language} (Limitadong system UI)

# settingsDataConsent
source: Data Collection Consent
fr: Consentement à la Collecte de Données
pt: Consentimento de Coleta de Dados
sw: Idhini ya Ukusanyaji wa Data
tl: Pahintulot sa Pagkolekta ng Data

# settingsConsentGranted
source: You have consented to data collection
fr: Vous avez consenti à la collecte de données
pt: Você consentiu com a coleta de dados
sw: Umeidhinisha ukusanyaji wa data
tl: Pumayag ka na sa pagkolekta ng data

# settingsConsentNotGranted
source: You have not consented
fr: Vous n'avez pas consenti
pt: Você não consentiu
sw: Hujaidhinisha
tl: Hindi ka pumayag

# settingsConsentDate
source: Consent Date
fr: Date de Consentement
pt: Data do Consentimento
sw: Tarehe ya Idhini
tl: Petsa ng Pahintulot

# settingsPrivacyPolicy
source: Privacy Policy
fr: Politique de Confidentialité
pt: Política de Privacidade
sw: Sera ya Faragha
tl: Patakaran sa Privacy

# settingsPrivacyPolicySubtitle
source: View our privacy policy
fr: Voir notre politique de confidentialité
pt: Ver nossa política de privacidade
sw: Tazama sera yetu ya faragha
tl: Tingnan ang aming privacy policy

# settingsFeedFormulations
source: Feed Formulations
fr: Formulations d'Aliment
pt: Formulações de Ração
sw: Miundo ya Chakula
tl: Mga Formulation ng Feed

# settingsCustomIngredients
source: Custom Ingredients
fr: Ingrédients Personnalisés
pt: Ingredientes Personalizados
sw: Vipengele Maalum
tl: Mga Custom na Sangkap

# settingsDatabaseSize
source: Database Size
fr: Taille de la Base de Données
pt: Tamanho do Banco de Dados
sw: Ukubwa wa Hifadhidata
tl: Laki ng Database

# settingsExportData
source: Export Data
fr: Exporter les Données
pt: Exportar Dados
sw: Hamisha Data
tl: I-export ang Data

# settingsExportDataSubtitle
source: Backup all your data
fr: Sauvegarder toutes vos données
pt: Fazer backup de todos os seus dados
sw: Hifadhi nakala ya data yako yote
tl: I-backup ang lahat ng iyong data

# settingsImportData
source: Import Data
fr: Importer les Données
pt: Importar Dados
sw: Leta Data
tl: I-import ang Data

# settingsImportDataSubtitle
source: Restore from backup
fr: Restaurer depuis une sauvegarde
pt: Restaurar do backup
sw: Rejesha kutoka kwa nakala
tl: Ibalik mula sa backup

# settingsDeleteData
source: Delete All Data
fr: Supprimer Toutes les Données
pt: Excluir Todos os Dados
sw: Futa Data Yote
tl: Tanggalin ang Lahat ng Data

# settingsDeleteDataSubtitle
source: Permanently delete everything
fr: Supprimer définitivement tout
pt: Excluir permanentemente tudo
sw: Futa kila kitu kabisa
tl: Permanenteng tanggalin ang lahat

# settingsVersion
source: Version
pt: Versão
sw: Toleo
tl: Bersyon

# settingsRateApp
source: Rate the App
fr: Évaluer l'Application
pt: Avaliar o Aplicativo
sw: Kadiria Programu
tl: I-rate ang App

# settingsRateAppSubtitle
source: Share your feedback
fr: Partager vos commentaires
pt: Compartilhar seus comentários
sw: Shiriki maoni yako
tl: Ibahagi ang iyong feedback

# settingsLicenses
source: Open Source Licenses
fr: Licences Open Source
pt: Licenças de Código Aberto
sw: Leseni za Chanzo Wazi
tl: Mga Open Source License

# settingsTermsOfService
source: Terms of Service
fr: Conditions d'Utilisation
pt: Termos de Serviço
sw: Masharti ya Huduma
tl: Mga Tuntunin ng Serbisyo

# settingsTermsComingSoon
source: Coming soon
fr: Bientôt disponible
pt: Em breve
sw: Inakuja hivi karibuni
tl: Paparating na

# settingsDataSafety
source: Data Safety
fr: Sécurité des Données
pt: Segurança de Dados
sw: Usalama wa Data
tl: Kaligtasan ng Data

# settingsDataSafetySubtitle
source: Your data is stored locally
fr: Vos données sont stockées localement
pt: Seus dados são armazenados localmente
sw: Data yako imehifadhiwa ndani
tl: Ang iyong data ay naka-imbak sa lokal

# settingsFooter
source: Made with ❤️ for livestock farmers
fr: Fait avec ❤️ pour les éleveurs de bétail
pt: Feito com ❤️ para criadores de gado
sw: Imetengenezwa kwa ❤️ kwa wakulima wa mifugo
tl: Ginawa nang may ❤️ para sa mga magsasaka ng hayop

# settingsExporting
source: Exporting data...
fr: Export des données...
pt: Exportando dados...
sw: Inahamisha data...
tl: Nag-e-export ng data...

# settingsExportSuccess
source: Export Successful
fr: Export Réussi
pt: Exportação Bem-Sucedida
sw: Uhamishaji Umefanikiwa
tl: Matagumpay ang Export

# settingsExportSuccessMessage
source: Your backup has been created successfully!
fr: Votre sauvegarde a été créée avec succès!
pt: Seu backup foi criado com sucesso!
sw: Nakala yako imeundwa kwa mafanikio!
tl: Matagumpay na nalikha ang iyong backup!

# settingsRevokeConsentTitle
source: Revoke Consent
fr: Révoquer le Consentement
pt: Revogar Consentimento
sw: Futa Idhini
tl: Bawiin ang Pahintulot

# settingsRevokeConsentMessage
source: Are you sure you want to revoke your consent? This will not delete your data, but you acknowledge that you no longer consent to data collection.
fr: Êtes-vous sûr de vouloir révoquer votre consentement? Cela ne supprimera pas vos données, mais vous reconnaissez que vous ne consentez plus à la collecte de données.
pt: Tem certeza de que deseja revogar seu consentimento? Isso não excluirá seus dados, mas você reconhece que não consente mais com a coleta de dados.
sw: Una uhakika unataka kufuta idhini yako? Hii haitafuta data yako, lakini unakubali kwamba hukubali tena ukusanyaji wa data.
tl: Sigurado ka bang gusto mong bawiin ang iyong pahintulot? Hindi nito tatanggalin ang iyong data, ngunit kinikilala mo na hindi ka na pumapayag sa pagkolekta ng data.

# settingsLanguageUpdated
source: Language updated to {language}
fr: Langue mise à jour vers {language}
pt: Idioma atualizado para {language}
sw: Lugha imesasishwa hadi {language}
tl: Na-update ang wika sa {language}

# ingredientLibraryTitle
source: Ingredient Library
fr: Bibliothèque d'Ingrédients
pt: Biblioteca de Ingredientes
sw: Maktaba ya Vijenzi
tl: Aklatan ng Sangkap

# manageInventoryTitle
source: MANAGE INVENTORY
fr: GÉRER L'INVENTAIRE
pt: GERENCIAR INVENTÁRIO
sw: SIMAMIA HIFADHI
tl: PAMAHALAAN ANG IMBENTARYO

# customIngredientsTitle
source: Custom Ingredients
fr: Ingrédients Personnalisés
pt: Ingredientes Personalizados
sw: Vijenzi vya Kawaida
tl: Customized na Sangkap

# updateDetailsTitle
source: Update Details
fr: Mettre à Jour les Détails
pt: Atualizar Detalhes
sw: Sasisha Maelezo
tl: I-update ang Detalye

# labelFavorite
source: Favorite
fr: Favori
pt: Favorito
sw: Pendwa
tl: Paboritong

# labelAddToFavorites
source: Add to favorites
fr: Ajouter aux favoris
pt: Adicionar aos favoritos
sw: Ongeza kwa mapendwa
tl: Idagdag sa mga paboritong

# labelPricePerKg
source: Price per kg
fr: Prix par kg
pt: Preço por kg
sw: Bei kwa kg
tl: Presyo bawat kg

# labelAvailableQty
source: Available Qty (kg)
fr: Quantité Disponible (kg)
pt: Quantidade Disponível (kg)
sw: Kiasi Kinachopo (kg)
tl: Available na Dami (kg)

# actionPriceHistory
source: Price History
fr: Historique des Prix
pt: Histórico de Preços
sw: Historia ya Bei
tl: Kasaysayan ng Presyo

# deleteIngredientTitle
source: Delete Ingredient?
fr: Supprimer l'Ingrédient?
pt: Excluir Ingrediente?
sw: Futa Kijinzi?
tl: Tanggalin ang Sangkap?
