Repository: ebena107/redesigned-feed-app
Catalog: lib/l10n/app_*.arb
Languages: fr, pt, sw, tl

# deleteIngredientMessage
source: This will permanently remove this ingredient from your library. This action cannot be undone.
fr: Cela supprimera définitivement cet ingrédient de votre bibliothèque. Cette action ne peut pas être annulée.
pt: Isso removerá permanentemente este ingrediente de sua biblioteca. Esta ação não pode ser desfeita.
sw: Hii itafuta kijinzi hiki kabisa mula kwenye maktaba yako. Hatua hii haiwezi kurudishwa.
tl: Ito ay permanenteng aalis ang sangkapong ito mula sa iyong aklatan. Ang aksyon na ito ay hindi maaaring i-undo.

# confirmCancel
source: Cancel
fr: Annuler
pt: Cancelar
sw: Ghairi
tl: Kanselahin

# successIngredientUpdated
source: Ingredient updated successfully
fr: Ingrédient mis à jour avec succès
pt: Ingrediente atualizado com sucesso
sw: Kijinzi kimesasishwa kwa mafanikio
tl: Ang sangkap ay na-update nang matagumpay

# errorSaveFailed
source: Failed to save: {error}
fr: Échec de l'enregistrement: {error}
pt: Falha ao salvar: {error}
sw: Kushindwa kuhifadhi: {error}
tl: Hindi nakapagsave: {error}

# successIngredientDeleted
source: Ingredient deleted
fr: Ingrédient supprimé
pt: Ingrediente excluído
sw: Kijinzi kimefutwa
tl: Tanggal na ang sangkap

# errorDeleteFailed
source: Failed to delete: {error}
fr: Échec de la suppression: {error}
pt: Falha ao excluir: {error}
sw: Kushindwa kufuta: {error}
tl: Hindi matanggal: {error}

# errorPriceGreaterThanZero
source: Must be > 0
fr: Doit être > 0
pt: Deve ser > 0
sw: Lazima kuwa > 0
tl: Dapat > 0

# errorQuantityGreaterOrEqual
source: Must be ≥ 0
fr: Doit être ≥ 0
pt: Deve ser ≥ 0
sw: Lazima kuwa ≥ 0
tl: Dapat ≥ 0

# addFeedTitle
source: Add/Check Feed
fr: Ajouter/Vérifier Aliment
pt: Adicionar/Verificar Ração
sw: Ongeza/Angalia Chakula
tl: Magdagdag/Suriin ang Feed

# updateFeedTitle
source: Update Feed
fr: Mettre à Jour l'Aliment
pt: Atualizar Ração
sw: Sasisha Chakula
tl: I-update ang Feed

# actionAddIngredients
source: Add Ingredients
fr: Ajouter des Ingrédients
pt: Adicionar Ingredientes
sw: Ongeza Vijenzi
tl: Magdagdag ng Mga Sangkap

# tooltipAddIngredients
source: Add more ingredients to feed
fr: Ajouter plus d'ingrédients à l'aliment
pt: Adicionar mais ingredientes à ração
sw: Ongeza vijenzi zaidi kwa chakula
tl: Magdagdag ng higit pang sangkap sa feed

# tooltipSaveFeed
source: Save feed
fr: Enregistrer l'aliment
pt: Guardar ração
sw: Hifadhi chakula
tl: I-save ang feed

# tooltipUpdateFeed
source: Update feed
fr: Mettre à jour l'aliment
pt: Atualizar ração
sw: Sasisha chakula
tl: I-update ang feed

# actionAnalyse
source: Analyse
fr: Analyser
pt: Analisar
sw: Chunguza
tl: Suriin

# tooltipAnalyseFeed
source: Analyse feed composition
fr: Analyser la composition de l'aliment
pt: Analisar composição da ração
sw: Chunguza muundo wa chakula
tl: Suriin ang komposisyon ng feed

# errorFeedNameRequired
source: Feed Name Required
fr: Nom de l'Aliment Requis
pt: Nome da Ração Obrigatório
sw: Jina la Chakula Linahitajika
tl: Kinakailangan ang Pangalan ng Feed

# errorFeedNameMessage
source: Please enter a name for your feed before saving.
fr: Veuillez saisir un nom pour votre aliment avant de l'enregistrer.
pt: Introduza um nome para a sua ração antes de guardar.
sw: Tafadhali weka jina la chakula chako kabla ya kuhifadhi.
tl: Pakilagay ang pangalan ng feed bago mag-save.

# errorMissingFeedName
source: Missing Feed Name
fr: Nom de l'Aliment Manquant
pt: Falta Nome da Ração
sw: Jina la Chakula Halijawekwa
tl: Walang Pangalan ng Feed

# errorMissingFeedNameMessage
source: Please enter a feed name before analysing.
fr: Veuillez saisir un nom d'aliment avant d'analyser.
pt: Introduza um nome de ração antes de analisar.
sw: Tafadhali weka jina la chakula kabla ya kuchunguza.
tl: Pakilagay ang pangalan ng feed bago ang pagsusuri.

# errorNoIngredients
source: No Ingredients
fr: Aucun Ingrédient
pt: Sem Ingredientes
sw: Hakuna Vijenzi
tl: Walang Sangkap

# errorNoIngredientsMessage
source: Please add at least one ingredient to analyse.
fr: Veuillez ajouter au moins un ingrédient pour analyser.
pt: Adicione pelo menos um ingrediente para analisar.
sw: Tafadhali ongeza angalau kijenzi kimoja ili kuchunguza.
tl: Magdagdag ng kahit isang sangkap para sa pagsusuri.

# errorInvalidQuantities
source: Invalid Quantities
fr: Quantités Invalides
pt: Quantidades Inválidas
sw: Kiasi Kisicho Sahihi
tl: Maling Dami

# errorInvalidQuantitiesMessage
source: All ingredients must have valid quantities greater than 0.
fr: Tous les ingrédients doivent avoir des quantités valides supérieures à 0.
pt: Todos os ingredientes devem ter quantidades válidas superiores a 0.
sw: Vijenzi vyote lazima viwe na kiasi sahihi kikubwa kuliko 0.
tl: Lahat ng sangkap ay dapat may wastong dami na mas malaki sa 0.

# errorGenericTitle
source: An Error Occurred
fr: Une Erreur s'est Produite
pt: Ocorreu um Erro
sw: Kosa Limetokea
tl: May Nagkaproblema

# errorGenericMessage
source: Please try again.
fr: Veuillez réessayer.
pt: Tente novamente.
sw: Tafadhali jaribu tena.
tl: Pakisubukang muli.

# analyseDialogTitle
source: Analyse Feed Composition
fr: Analyser la Composition de l'Aliment
pt: Analisar Composição da Ração
sw: Chunguza Muundo wa Chakula
tl: Suriin ang Komposisyon ng Feed

# analyseDialogMessageNew
source: View detailed nutritional analysis for "{feedName}" without saving it.
fr: Voir l'analyse nutritionnelle détaillée de "{feedName}" sans l'enregistrer.
pt: Ver análise nutricional detalhada de "{feedName}" sem guardá-la.
sw: Angalia uchambuzi wa lishe la "{feedName}" bila kuhifadhi.
tl: Tingnan ang detalyadong pagsusuri para sa "{feedName}" nang hindi sine-save.

# analyseDialogMessageUpdate
source: View detailed nutritional analysis for "{feedName}" without updating it.
fr: Voir l'analyse nutritionnelle détaillée de "{feedName}" sans la mettre à jour.
pt: Ver análise nutricional detalhada de "{feedName}" sem atualizá-la.
sw: Angalia uchambuzi wa lishe la "{feedName}" bila kusasisha.
tl: Tingnan ang detalyadong pagsusuri para sa "{feedName}" nang hindi nag-a-update.

# analyseDialogPreviewNote
source: This is a preview. You can save later.
fr: Ceci est un aperçu. Vous pouvez enregistrer plus tard.
pt: Esta é uma pré-visualização. Pode guardar mais tarde.
sw: Hii ni hakiki ya awali. Unaweza kuhifadhi baadaye.
tl: Ito ay preview. Maaari mong i-save mamaya.

# analyseDialogNoSaveNote
source: Changes will not be saved.
fr: Les modifications ne seront pas enregistrées.
pt: As alterações não serão guardadas.
sw: Mabadiliko hayatahifadhiwa.
tl: Hindi mase-save ang mga pagbabago.

# analyseDialogFailedMessage
source: Failed to analyse feed. Please try again.
fr: Échec de l'analyse de l'aliment. Veuillez réessayer.
pt: Falha na análise da ração. Tente novamente.
sw: Uchambuzi wa chakula umeshindwa. Tafadhali jaribu tena.
tl: Nabigo ang pagsusuri ng feed. Pakisubukang muli.

# reportTitleEstimate
source: Estimated Analysis
fr: Analyse Estimée
pt: Análise Estimada
sw: Uchambuzi wa Kadiria
tl: Tantiyang Pagsusuri

# reportTitleAnalysis
source: Analysis Report
fr: Rapport d'Analyse
pt: Relatório de Análise
sw: Ripoti ya Uchambuzi
tl: Ulat ng Pagsusuri

# nutrientDigestiveEnergy
source: Digestive Energy
fr: Énergie Digestible
pt: Energia Digestível
sw: Nishati ya Kuchovya
tl: Natutunaw na Enerhiya

# nutrientMetabolicEnergy
source: Metabolic Energy
fr: Énergie Métabolisable
pt: Energia Metabolizável
sw: Nishati ya Kimetaboliki
tl: Metabolic na Enerhiya

# nutrientCrudeProtein
source: Crude Protein
fr: Protéine Brute
pt: Proteína Bruta
sw: Protini Ghafi
tl: Krudong Protina

# nutrientCrudeFiber
source: Crude Fiber
fr: Fibre Brute
pt: Fibra Bruta
sw: Nyuzi Ghafi
tl: Krudong Hibla

# nutrientCrudeFat
source: Crude Fat
fr: Graisse Brute
pt: Gordura Bruta
sw: Mafuta Ghafi
tl: Krudong Taba

# nutrientCalcium
source: Calcium
pt: Cálcio
sw: Kalisiamu

# nutrientPhosphorus
source: Phosphorus
fr: Phosphore
pt: Fósforo
sw: Phosphorasi
tl: Posporus

# nutrientLysine
source: Lysine
pt: Lisina
tl: Lisina

# nutrientMethionine
source: Methionine
fr: Méthionine
pt: Metionina
tl: Metiyonina

# nutrientAsh
source: Ash
fr: Cendres
pt: Cinzas
sw: Majivu
tl: Abo

# nutrientMoisture
source: Moisture
fr: Humidité
pt: Humidade
sw: Unyevunyevu
tl: Halumigmig

# nutrientAvailablePhosphorus
source: Avail. P
fr: Phosp. Dispon.
pt: Fósf. Dispon.
sw: Phosph. Inapatikana
tl: Magagamit na Posporus

# nutrientTotalPhosphorus
source: Total P
fr: Phosp. Total
pt: Fósf. Total
sw: Phosph. Jumla
tl: Kabuuang Posporus

# nutrientPhytatePhosphorus
source: Phytate P
fr: Phosp. Phytate
pt: Fósf. Fitato
sw: Phosph. Phytate
tl: Posporus ng Pitate

# aminoAcidProfileTitle
source: Amino Acid Profile
fr: Profil des Acides Aminés
pt: Perfil de Aminoácidos
sw: Profaili ya Asidi ya Amino
tl: Profayl ng Amino Asido

# aminoAcidSidLabel
source: SID (Digestible)
pt: SID (Digestível)
sw: SID (Inayoweza Kuchovya)
tl: SID (Natutunaw)

# aminoAcidTableHeaderName
source: Amino Acid
fr: Acide Aminé
pt: Aminoácido
sw: Asidi ya Amino
tl: Amino Asido

# aminoAcidTableHeaderContent
source: Content (%)
fr: Contenu (%)
pt: Conteúdo (%)
sw: Yaliyomo (%)
tl: Nilalaman (%)

# aminoAcidLysine
source: Lysine
pt: Lisina
tl: Lisina

# aminoAcidMethionine
source: Methionine
fr: Méthionine
pt: Metionina
tl: Metiyonina

# aminoAcidCystine
source: Cystine
pt: Cistina
tl: Sistina

# aminoAcidThreonine
source: Threonine
fr: Thréonine
pt: Treonina
tl: Treonina

# aminoAcidTryptophan
source: Tryptophan
fr: Tryptophane
pt: Triptofano
tl: Triptofan

# aminoAcidArginine
source: Arginine
pt: Arginina
tl: Arjinin

# aminoAcidIsoleucine
source: Isoleucine
pt: Isoleucina
tl: Isolusin

# aminoAcidLeucine
source: Leucine
pt: Leucina
tl: Leusin

# aminoAcidValine
source: Valine
pt: Valina
tl: Valin

# aminoAcidHistidine
source: Histidine
pt: Histidina
tl: Histidina

# aminoAcidPhenylalanine
source: Phenylalanine
fr: Phénylalanine
pt: Fenilalanina
tl: Fenilalanina

# aminoAcidSidInfo
source: SID = Standardized Ileal Digestible (industry standard)
fr: SID = Digestibilité Iléale Standardisée (norme de l'industrie)
pt: SID = Digestibilidade Ileal Padronizada (padrão da indústria)
sw: SID = Uchovyo wa Ileal Uliowekwa Viwango (kiwango cha sekta)
tl: SID = Pamantayang ileal na natutunaw (pamantayan ng industriya)

# aminoAcidTotalInfo
source: Total amino acids (not all digestible)
fr: Acides aminés totaux (pas tous digestibles)
pt: Aminoácidos totais (nem todos digestíveis)
sw: Asidi za amino jumla (si zote zinachovywa)
tl: Kabuuang amino acid (hindi lahat ay natutunaw)

# aminoAcidLoadError
source: Error loading amino acid data
fr: Erreur lors du chargement des données des acides aminés
pt: Erro ao carregar dados de aminoácidos
sw: Kosa la kupakia data ya asidi ya amino
tl: Nagka-error sa paglo-load ng data ng amino acid

# warningsCardTitle
source: Warnings & Recommendations
fr: Avertissements et Recommandations
pt: Avisos e Recomendações
sw: Maonyo na Mapendekezo
tl: Mga Babala at Rekomendasyon

# warningsCardIssueCount
source: {count, plural, =1{1 issue found} other{{count} issues found}}
fr: {count, plural, =1{1 problème trouvé} other{{count} problèmes trouvés}}
pt: {count, plural, =1{1 problema encontrado} other{{count} problemas encontrados}}
sw: {count, plural, =1{Shida 1 imepatikana} other{{count} shida zimepatikana}}
tl: {count, plural, =1{1 isyu ang nahanap} other{{count} mga isyu ang nahanap}}

# pdfPreviewTitle
source: Ebena Feed Estimator | {feedName} Print Preview
fr: Ebena Feed Estimator | Aperçu de {feedName}
pt: Ebena Feed Estimator | Pré-visualização de {feedName}
sw: Ebena Feed Estimator | {feedName} Hakiki ya Kuchapisha

# noIngredientsSelected
source: No ingredients selected yet
fr: Aucun ingrédient sélectionné pour le moment
pt: Nenhum ingrediente selecionado ainda

source: Selected Ingredients
fr: Ingrédients Sélectionnés
pt: Ingredientes Selecionados

# formSectionBasicInfo
source: Basic Information
fr: Informations de base
pt: Informações Básicas

# formSectionEnergyValues
source: Energy Values
fr: Valeurs énergétiques
pt: Valores de Energia

# formSectionMacronutrients
source: Macronutrients
fr: Macronutriments
pt: Macronutrientes

# formSectionMicronutrients
source: Micronutrients
fr: Micronutriments
pt: Micronutrientes

# formSectionCostAvailability
source: Cost & Availability
fr: Coût et disponibilité
pt: Custo e Disponibilidade

# formSectionAdditionalInfo
source: Additional Information
fr: Informations supplémentaires
pt: Informações Adicionais

# fieldHintEnergyMode
source: Enter Energy Values for each specific group of animals?
fr: Saisir des valeurs d'énergie pour chaque groupe spécifique d'animaux ?
pt: Inserir valores de energia para cada grupo específico de animais?

# fieldLabelAdultPigs
source: Adult Pigs
fr: Porcs adultes
pt: Suínos adultos

# fieldLabelGrowingPigs
source: Growing Pigs
fr: Porcs en croissance
pt: Suínos em crescimento

# fieldLabelPoultry
source: Poultry
fr: Volaille
pt: Aves

# fieldLabelRabbit
source: Rabbit
fr: Lapin
pt: Coelho

# fieldLabelRuminant
source: Ruminant
pt: Ruminante

# fieldLabelFish
source: Fish
fr: Poisson
pt: Peixe

# fieldLabelCreatedBy
source: Created By
fr: Créé par
pt: Criado por

# fieldLabelNotes
source: Notes
pt: Notas

# customIngredientHeader
source: Creating Custom Ingredient
fr: Création d'un ingrédient personnalisé
pt: Criando Ingrediente Personalizado

# customIngredientDescription
source: You can add your own ingredient with custom nutritional values
fr: Vous pouvez ajouter votre propre ingrédient avec des valeurs nutritionnelles personnalisées
pt: Você pode adicionar seu próprio ingrediente com valores nutricionais personalizados

# newIngredientTitle
source: New Ingredient
fr: Nouvel ingrédient
pt: Novo Ingrediente

# fieldLabelFeedName
source: Feed Name
fr: Nom de l'aliment
pt: Nome da Ração

# fieldLabelAnimalType
source: Animal Type
fr: Type d'animal
pt: Tipo de Animal

# fieldLabelProductionStage
source: Production Stage
fr: Stade de production
pt: Estágio de Produção

# ingredientAddedSuccessTitle
source: {name} Added Successfully
fr: {name} Ajouté avec Succès
pt: {name} adicionado com sucesso

# ingredientAddedSuccessMessage
source: Would you like to add another ingredient?
fr: Voulez-vous ajouter un autre ingrédient?
pt: Deseja adicionar outro ingrediente?

# ingredientAddedNo
source: No, Go Back
fr: Non, Retour
pt: Não, Voltar

# ingredientAddedYes
source: Yes, Continue
fr: Oui, Continuer
pt: Sim, Continuar

# customIngredientsHeader
source: Your Custom Ingredients ({count})
fr: Vos Ingrédients Personnalisés ({count})
pt: Seus Ingredientes Personalizados ({count})

# customIngredientsSearchHint
source: Search your custom ingredients...
fr: Rechercher vos ingrédients personnalisés...
pt: Pesquisar seus ingredientes personalizados...

# customIngredientsEmptyTitle
source: No custom ingredients yet
fr: Pas encore d'ingrédients personnalisés
pt: Nenhum ingrediente personalizado ainda

# customIngredientsEmptySubtitle
source: Create your first custom ingredient!
fr: Créez votre premier ingrédient personnalisé!
pt: Crie seu primeiro ingrediente personalizado!

# customIngredientsNoMatch
source: No ingredients match your search
fr: Aucun ingrédient ne correspond à votre recherche
pt: Nenhum ingrediente corresponde à sua pesquisa

# labelCreatedBy
source: by {creator}
fr: par {creator}
pt: por {creator}

# labelNotes
source: Notes:
pt: Notas:

# labelPriceHistory
source: Price History
fr: Historique des Prix
pt: Histórico de Preços

# priceHistoryEmpty
source: No price history available
fr: Aucun historique de prix disponible
pt: Sem histórico de preços

# priceHistoryError
source: Error loading price history
fr: Erreur lors du chargement de l'historique des prix
pt: Falha ao carregar histórico de preços

# deleteCustomIngredientTitle
source: Delete Custom Ingredient?
fr: Supprimer l'Ingrédient Personnalisé?
pt: Excluir "{name}"?

# deleteCustomIngredientMessage
source: Remove "{name}" from your custom ingredients?
fr: Retirer "{name}" de vos ingrédients personnalisés?
pt: Tem certeza de que deseja excluir este ingrediente personalizado?

# ingredientRemovedSuccess
source: {name} removed
fr: {name} supprimé
pt: {name} removido

# exportFormatTitle
source: Export Format
fr: Format d'Exportation
pt: Formato de Exportação

# exportFormatMessage
source: Choose export format for your custom ingredients:
fr: Choisissez le format d'exportation pour vos ingrédients personnalisés:
pt: Escolha o formato de exportação para seus ingredientes personalizados:

source: Exporting to JSON...
fr: Exportation vers JSON...
pt: Exportando para JSON...

source: Exporting to CSV...
fr: Exportation vers CSV...
pt: Exportando para CSV...

source: Export failed
fr: Échec de l'exportation
pt: Falha na exportação

# exportFailedWithError
source: Export failed: {error}
fr: Échec de l'exportation: {error}
pt: Falha na exportação: {error}

# importCustomIngredientsTitle
source: Import Custom Ingredients
fr: Importer des Ingrédients Personnalisés
pt: Importar Ingredientes Personalizados

# importFormatMessage
source: Choose the file format to import:
fr: Choisissez le format de fichier à importer:
pt: Escolha o formato do arquivo para importar:

source: Importing data...
fr: Importation des données...
pt: Importando dados...

# importSuccessTitle
source: Import Successful
fr: Importation Réussie
pt: Importação Bem-sucedida

# importFailedTitle
source: Import Failed
fr: Échec de l'Importation
pt: Falha na Importação

# importError
source: Error: {error}
fr: Erreur: {error}
pt: Erro: {error}

# labelIngredient
source: Ingredient
fr: Ingrédient
pt: Ingrediente

# regionOceania
source: Oceania
fr: Océanie
sw: Okinoya

# regionGlobal
source: Global
fr: Mondial
sw: Ulimwengu
tl: Pandaigdigan

# unitTon
source: ton
fr: tonne
sw: tani
tl: tonelada

# settingsSectionLegal
source: Legal
fr: Légal
sw: Kisheria

# labelTotal
source: Total
sw: Jumla
tl: Kabuuan

# unitKcal
source: kcal/kg
sw: Kcal
tl: Kcal

# aminoAcidTotalLabel
source: Total
sw: Jumla
tl: Kabuuan

# aminoAcidTotalButton
source: Total
sw: Jumla
tl: Kabuuan

# actionOk
source: OK
sw: SAWA
